<script setup></script>

<template>
  <div class="container mx-auto p-4 mt-[50px]">
    <div class="flex flex-col md:flex-row gap-4">
      <!-- First div -->
      <div class="ryan flex-1 p-6 flex justify-center items-center">
        <img class="w-[300px]" src="/ryan.png" alt="" />
      </div>

      <!-- Second div -->
      <div class="flex-1">
        <div class="paragraph1">
          <h1 class="text-right text-[40px]">رشد و تحول شخصی</h1>
          <p class="text-right pt-[20px]">
            در دنیای پرشتاب و پرچالش امروز، هر جوان ایرانی بیش از هر زمان دیگری
            نیاز دارد تا مهارت‌ها، استعدادها و توانمندی‌های درونی خود را شناسایی
            و شکوفا کند. رشد فردی و سلف‌امپرومنت نه‌تنها یک انتخاب بلکه ضرورتی
            برای داشتن آینده‌ای روشن، شغل موفق و روابط انسانی سالم است. سایت ما
            با همین هدف طراحی شده است؛ فضایی پویا و الهام‌بخش که با ترکیبی از
            منابع آموزشی معتبر، تمرین‌های عملی، راهکارهای روانشناسی کاربردی و
            محتوای انگیزشی، مسیر پیشرفت را برای شما هموار می‌سازد. ما باور داریم
            که هر فرد توانایی خلق نسخه‌ای بهتر از خود را دارد، نسخه‌ای که
            می‌تواند با اعتماد به نفس بالاتر، تصمیم‌گیری‌های هوشمندانه‌تر و
            نگرشی مثبت‌تر به زندگی نگاه کند. اینجا فرصتی است برای کشف
            توانایی‌های نهفته، تقویت مهارت‌های فردی و اجتماعی، افزایش اعتماد به
            نفس، مدیریت بهتر احساسات و ساختن ذهنیتی قدرتمند که شما را برای
            مواجهه با چالش‌های زندگی آماده می‌سازد. با ما، هر گام شما در مسیر
            یادگیری و رشد، گامی به سوی آینده‌ای روشن‌تر و موفق‌تر خواهد بود.
          </p>
        </div>
        <a
          href="#"
          class="flex text-right text-[15px] pt-[10px] text-blue-500 hover:text-blue-700 transition"
          ><img
            class=""
            src="/link_24dp_000000_FILL0_wght400_GRAD0_opsz24.svg"
            alt=""
          />
          اطلاعات بیشتر</a
        >
      </div>
    </div>
  </div>
</template>

<style scoped>
@media (max-width: 768px) {
 .ryan img {
    width: 150px;
  }
}
</style>
